In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Data.xlsx", sheet_name = 'Day 4')
df

   order_id  seller_id  customer_id order_date
0         1          3            5 2019-08-01
1         2          3            6 2019-08-02
2         3          7            7 2019-08-01
3         4          7            6 2019-08-02
4         5          7            1 2019-07-22
5         6          4            4 2019-07-21
6         7          4            4 2019-07-21

In [3]:
temp = df[df['seller_id'] == df['customer_id']][['seller_id']]
temp

   seller_id
2          7
5          4
6          4

In [4]:
temp = temp.drop_duplicates()
temp

   seller_id
2          7
5          4

In [5]:
temp = temp.sort_values(by='seller_id',ascending = True)
temp

   seller_id
5          4
2          7

In [6]:
temp.columns = ['id']
temp

   id
5   4
2   7

In [7]:
day = pd.read_excel("Data.xlsx",sheet_name='Day 5')
day

   review_id                                        review_text
0          1                 Great hotel with excellent service
1          2  The room was clean and spacious, but the staff...
2          3  The hotel was lovely, and the staff were incre...

In [8]:
df = day[day['review_text'].str.len() > 50][['review_id']]
df

   review_id
1          2
2          3